Ran Plan for 2 projects:

1. dir: `Dev` workspace: `default`
1. dir: `Staging` workspace: `default`

### 1. dir: `Dev` workspace: `default`
<details><summary>Show Output</summary>

```diff

Initializing the backend...

Successfully configured the backend "local"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/aws versions matching "5.16.0"...
- Installing hashicorp/aws v5.16.0...
- Installed hashicorp/aws v5.16.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!


Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/aws v5.16.0

Terraform has been successfully initialized!
data.aws_availability_zones.available: Reading...
data.aws_availability_zones.available: Read complete after 0s [id=eu-west-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eip.nat_eip will be created
  + resource "aws_eip" "nat_eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"        = "Alex-Development-eip"
          + "environment" = "Alex-Development"
        }
      + tags_all             = {
          + "Name"        = "Alex-Development-eip"
          + "environment" = "Alex-Development"
        }
      + vpc                  = (known after apply)
    }

  # aws_internet_gateway.int_gw will be created
  + resource "aws_internet_gateway" "int_gw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"        = "Alex-Development-igw"
          + "environment" = "Alex-Development"
        }
      + tags_all = {
          + "Name"        = "Alex-Development-igw"
          + "environment" = "Alex-Development"
        }
      + vpc_id   = (known after apply)
    }

  # aws_nat_gateway.nat_gw will be created
  + resource "aws_nat_gateway" "nat_gw" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name"        = "Alex-Development-nat_gw"
          + "environment" = "Alex-Development"
        }
      + tags_all                           = {
          + "Name"        = "Alex-Development-nat_gw"
          + "environment" = "Alex-Development"
        }
    }

  # aws_route.database_default will be created
  + resource "aws_route" "database_default" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.private_default will be created
  + resource "aws_route" "private_default" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.public_default will be created
  + resource "aws_route" "public_default" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route_table.database will be created
  + resource "aws_route_table" "database" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"        = "Alex-Development-database-route"
          + "environment" = "Alex-Development"
        }
      + tags_all         = {
          + "Name"        = "Alex-Development-database-route"
          + "environment" = "Alex-Development"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.private will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"        = "Alex-Development-private-route"
          + "environment" = "Alex-Development"
        }
      + tags_all         = {
          + "Name"        = "Alex-Development-private-route"
          + "environment" = "Alex-Development"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"        = "Alex-Development-public-route"
          + "environment" = "Alex-Development"
        }
      + tags_all         = {
          + "Name"        = "Alex-Development-public-route"
          + "environment" = "Alex-Development"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.db_association[0] will be created
  + resource "aws_route_table_association" "db_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.db_association[1] will be created
  + resource "aws_route_table_association" "db_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private_association[0] will be created
  + resource "aws_route_table_association" "private_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private_association[1] will be created
  + resource "aws_route_table_association" "private_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_association[0] will be created
  + resource "aws_route_table_association" "public_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_association[1] will be created
  + resource "aws_route_table_association" "public_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_subnet.db[0] will be created
  + resource "aws_subnet" "db" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "Alex-Development-db0"
          + "environment" = "Alex-Development"
        }
      + tags_all                                       = {
          + "Name"        = "Alex-Development-db0"
          + "environment" = "Alex-Development"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.db[1] will be created
  + resource "aws_subnet" "db" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "Alex-Development-db1"
          + "environment" = "Alex-Development"
        }
      + tags_all                                       = {
          + "Name"        = "Alex-Development-db1"
          + "environment" = "Alex-Development"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.priv[0] will be created
  + resource "aws_subnet" "priv" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "Alex-Development-priv_0"
          + "environment" = "Alex-Development"
        }
      + tags_all                                       = {
          + "Name"        = "Alex-Development-priv_0"
          + "environment" = "Alex-Development"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.priv[1] will be created
  + resource "aws_subnet" "priv" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "Alex-Development-priv_1"
          + "environment" = "Alex-Development"
        }
      + tags_all                                       = {
          + "Name"        = "Alex-Development-priv_1"
          + "environment" = "Alex-Development"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.pub[0] will be created
  + resource "aws_subnet" "pub" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "Alex-Development-pub_0"
          + "environment" = "Alex-Development"
        }
      + tags_all                                       = {
          + "Name"        = "Alex-Development-pub_0"
          + "environment" = "Alex-Development"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.pub[1] will be created
  + resource "aws_subnet" "pub" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "Alex-Development-pub_1"
          + "environment" = "Alex-Development"
        }
      + tags_all                                       = {
          + "Name"        = "Alex-Development-pub_1"
          + "environment" = "Alex-Development"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.vpc will be created
  + resource "aws_vpc" "vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "192.168.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"        = "Alex-Development-vpc"
          + "environment" = "Alex-Development"
        }
      + tags_all                             = {
          + "Name"        = "Alex-Development-vpc"
          + "environment" = "Alex-Development"
        }
    }

Plan: 22 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + db_subnets      = [
      + (known after apply),
      + (known after apply),
    ]
  + private_subnets = [
      + (known after apply),
      + (known after apply),
    ]
  + public_subnets  = [
      + (known after apply),
      + (known after apply),
    ]
  + vpc_id          = (known after apply)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d Dev`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis.alexmelidevops.cloud/lock?id=jalexkam%252Fbasic-terraform%252FDev%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d Dev`
</details>
Plan: 22 to add, 0 to change, 0 to destroy.

---
### 2. dir: `Staging` workspace: `default`
<details><summary>Show Output</summary>

```diff

Initializing the backend...

Successfully configured the backend "local"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/aws versions matching "5.16.0"...
- Installing hashicorp/aws v5.16.0...
- Installed hashicorp/aws v5.16.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!


Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/aws v5.16.0

Terraform has been successfully initialized!
data.aws_availability_zones.available: Reading...
data.aws_availability_zones.available: Read complete after 0s [id=eu-west-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eip.nat_eip will be created
  + resource "aws_eip" "nat_eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"        = "Alex-Staging-eip"
          + "environment" = "Alex-Staging"
        }
      + tags_all             = {
          + "Name"        = "Alex-Staging-eip"
          + "environment" = "Alex-Staging"
        }
      + vpc                  = (known after apply)
    }

  # aws_internet_gateway.int_gw will be created
  + resource "aws_internet_gateway" "int_gw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"        = "Alex-Staging-igw"
          + "environment" = "Alex-Staging"
        }
      + tags_all = {
          + "Name"        = "Alex-Staging-igw"
          + "environment" = "Alex-Staging"
        }
      + vpc_id   = (known after apply)
    }

  # aws_nat_gateway.nat_gw will be created
  + resource "aws_nat_gateway" "nat_gw" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name"        = "Alex-Staging-nat_gw"
          + "environment" = "Alex-Staging"
        }
      + tags_all                           = {
          + "Name"        = "Alex-Staging-nat_gw"
          + "environment" = "Alex-Staging"
        }
    }

  # aws_route.database_default will be created
  + resource "aws_route" "database_default" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.private_default will be created
  + resource "aws_route" "private_default" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.public_default will be created
  + resource "aws_route" "public_default" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route_table.database will be created
  + resource "aws_route_table" "database" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"        = "Alex-Staging-database-route"
          + "environment" = "Alex-Staging"
        }
      + tags_all         = {
          + "Name"        = "Alex-Staging-database-route"
          + "environment" = "Alex-Staging"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.private will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"        = "Alex-Staging-private-route"
          + "environment" = "Alex-Staging"
        }
      + tags_all         = {
          + "Name"        = "Alex-Staging-private-route"
          + "environment" = "Alex-Staging"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"        = "Alex-Staging-public-route"
          + "environment" = "Alex-Staging"
        }
      + tags_all         = {
          + "Name"        = "Alex-Staging-public-route"
          + "environment" = "Alex-Staging"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.db_association[0] will be created
  + resource "aws_route_table_association" "db_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.db_association[1] will be created
  + resource "aws_route_table_association" "db_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private_association[0] will be created
  + resource "aws_route_table_association" "private_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private_association[1] will be created
  + resource "aws_route_table_association" "private_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_association[0] will be created
  + resource "aws_route_table_association" "public_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_association[1] will be created
  + resource "aws_route_table_association" "public_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_subnet.db[0] will be created
  + resource "aws_subnet" "db" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.100.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "Alex-Staging-db0"
          + "environment" = "Alex-Staging"
        }
      + tags_all                                       = {
          + "Name"        = "Alex-Staging-db0"
          + "environment" = "Alex-Staging"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.db[1] will be created
  + resource "aws_subnet" "db" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.100.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "Alex-Staging-db1"
          + "environment" = "Alex-Staging"
        }
      + tags_all                                       = {
          + "Name"        = "Alex-Staging-db1"
          + "environment" = "Alex-Staging"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.priv[0] will be created
  + resource "aws_subnet" "priv" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.100.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "Alex-Staging-priv_0"
          + "environment" = "Alex-Staging"
        }
      + tags_all                                       = {
          + "Name"        = "Alex-Staging-priv_0"
          + "environment" = "Alex-Staging"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.priv[1] will be created
  + resource "aws_subnet" "priv" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.100.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "Alex-Staging-priv_1"
          + "environment" = "Alex-Staging"
        }
      + tags_all                                       = {
          + "Name"        = "Alex-Staging-priv_1"
          + "environment" = "Alex-Staging"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.pub[0] will be created
  + resource "aws_subnet" "pub" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.100.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "Alex-Staging-pub_0"
          + "environment" = "Alex-Staging"
        }
      + tags_all                                       = {
          + "Name"        = "Alex-Staging-pub_0"
          + "environment" = "Alex-Staging"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.pub[1] will be created
  + resource "aws_subnet" "pub" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.100.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "Alex-Staging-pub_1"
          + "environment" = "Alex-Staging"
        }
      + tags_all                                       = {
          + "Name"        = "Alex-Staging-pub_1"
          + "environment" = "Alex-Staging"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.vpc will be created
  + resource "aws_vpc" "vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "172.100.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"        = "Alex-Staging-vpc"
          + "environment" = "Alex-Staging"
        }
      + tags_all                             = {
          + "Name"        = "Alex-Staging-vpc"
          + "environment" = "Alex-Staging"
        }
    }

Plan: 22 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + db_subnets      = [
      + (known after apply),
      + (known after apply),
    ]
  + private_subnets = [
      + (known after apply),
      + (known after apply),
    ]
  + public_subnets  = [
      + (known after apply),
      + (known after apply),
    ]
  + vpc_id          = (known after apply)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d Staging`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis.alexmelidevops.cloud/lock?id=jalexkam%252Fbasic-terraform%252FStaging%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d Staging`
</details>
Plan: 22 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
